In [10]:
from datetime import datetime
import pandas as pd

<h1>The dataframe</h1>

In [11]:
student = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Song', 'Biden', 'Trump'],
    'score': [100, 20, 90]
})

student

   id   name  score
0   1   Song    100
1   2  Biden     20
2   3  Trump     90

<h1>Add columns</h1>

In [12]:
now = datetime.now()

student['double_score'] = 2 * student['score']
student['nick_name'] = None
student['enrollment'] = now
student

   id   name  score  double_score nick_name                 enrollment
0   1   Song    100           200      None 2025-07-28 17:36:17.865982
1   2  Biden     20            40      None 2025-07-28 17:36:17.865982
2   3  Trump     90           180      None 2025-07-28 17:36:17.865982